<h2>建立一個學生成績陣列</h2>

<?php

$score=[
    '姓名'=>'judy',
    '國文'=>95,
    '英文'=>64,
    '數學'=>70,
    '地理'=>90,
    '歷史'=>84
];
print_r($score);
echo "<br>";
$score=[
    '姓名'=>'amo',
    '國文'=>88,
    '英文'=>78,
    '數學'=>54,
    '地理'=>81,
    '歷史'=>71
];
print_r($score);
echo "<br>";
$score=[
    '姓名'=>'john',
    '國文'=>45,
    '英文'=>60,
    '數學'=>68,
    '地理'=>70,
    '歷史'=>62
];
print_r($score);
echo "<br>";
$score=[
    '姓名'=>'peter',
    '國文'=>59,
    '英文'=>32,
    '數學'=>77,
    '地理'=>54,
    '歷史'=>42
];
print_r($score);
echo "<br>";
$score=[
    '姓名'=>'hebe',
    '國文'=>71,
    '英文'=>62,
    '數學'=>80,
    '地理'=>62,
    '歷史'=>64
];
print_r($score);
echo $score['姓名'];
?>

<h2>老師的作法</h2>
<?php
$subject=['國文','英文','數學','地理','歷史'];
$judy=[95,64,70,90,84];
$amo=[88,78,54,81,71];
$john=[45,60,68,70,62];
$peter=[59,60,68,70,62];
$hebe=[71,62,80,62,64];

// 計算國文平均成績
$avg=($judy[0]+$amo[0]+$john[0]+$peter[0]+$hebe[0])/ 5;
echo $avg;

?>
<h2>另一個方法:</h2>
<?php
// $students=[
//     '國文'=>[['name'=>'judy',
//             'score'=>95],
//     ['name'=>'amo',
//     'score'=>88],

// ]