<h2>威力彩電腦選號沒有重覆號碼(利用while迴圈)</h2>
<ul>
    <li>使用亂數函式rand($a,$b)來產生號碼</li>
    <li>將產生的號碼順序存入陣列中</li>
    <li>每次存入陣列中時會先檢查陣列中的資料有沒有重覆</li>
    <li>完成選號後將陣列內容印出</li>
</ul>
<?php
// // 3.產生一個陣列
// $num=[];
// // 1. 亂數最小和最大值
// // 2. 跑六次但是有重覆
// for ($i=0;$i<6;$i++){

//     $tmp=rand(1,38);
//     // 先暫時存起來

//     // 會因為有重覆時，沒有執行然後少數字
//     if(!in_array($tmp,$num)){
//         $num[]=$tmp;
//     }
// }

// foreach($num as $n){
//     echo $n.",";
// }


$num = [];

while (count($num) < 6) {
    // 小於六的狀況
    // 亂數是否在這陣列裡面

    // 先暫時存起來
    $tmp = rand(1, 38);
    // 判斷$tmp值是否有在$num陣列中
    // 如果$tmp沒有在$num陣列裡意思是沒有重覆
    if (!in_array($tmp, $num)) {
        $num[] = $tmp;
    }
}

foreach ($num as $n) {
    echo $n . ",";
}
?>

<h2>找出五百年內的閏年</h2>
<ul>
    <li>請依照閏年公式找出五百年內的閏年</li>
    <li>使用陣列來儲存閏年</li>
    <li>使用迴圈來印出閏年</li>
</ul>

<?php
// 閏年定義:可以被4整除，但不能被100整除。
// 閏年定義:能夠被100整除，且能被400整除。
// $years=[];
for ($years = 2023; $years <= 2523; $years++) {
    if (($years % 4 == 0 && $years % 100 != 0) || $years % 400 == 0) {
        echo $years . "是閏年";
        echo ",";
    } else {
        echo "";
        // echo $years. "是平年";
        // echo "<br>";
    }
}
?>

<!-- 2023~2523 -->

<?php
// 用陣列來存放
$years = [];
for ($i = 2023; $i <= 2523; $i++) {
    if (($i % 4 == 0 && $i % 100 != 0) || $i % 400 == 0) {
        $years[] = $i;
    }
}

foreach ($years as $key => $year) {
    echo $year . ", ";
}

?>

<!-- 天干 10個(重覆6次)
甲乙丙丁戊己庚辛壬癸
地支 12個(重覆五次)
子丑寅卯辰巳午未申酉戌亥 
放入excel 跟餘數有關 -->

<h2>已知西元1024年為甲子年，請設計一支程式，可以接受任一西元年份，輸出對應的天干地支的年別。(利用迴圈)</h2>
<ul>
    <li>天干：甲乙丙丁戊己庚辛壬癸</li>
    <li>地支：子丑寅卯辰巳午未申酉戌亥</li>
    <li>天干地支配對：甲子、乙丑、丙寅….甲戌、乙亥、丙子….</li>
</ul>

<?php
$year=2000;
$sky=['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'];
$land=['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'];

echo "西元".$year. "是";
echo $sky[($year-1024)%10];
echo $land[($year-1024)%12];
echo "年";